Examinator/src/Enums/СтатусыПроцессаОбученияСУО/СтатусыПроцессаОбученияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыПроцессаОбученияСУО</name>
  <enumValues>
    <name>Запланировано</name>
  </enumValues>
  <enumValues>
    <name>Новое</name>
  </enumValues>
  <enumValues>
    <name>НеДопущен</name>
  </enumValues>
  <enumValues>
    <name>Активно</name>
  </enumValues>
  <enumValues>
    <name>Проверяется</name>
  </enumValues>
  <enumValues>
    <name>ВозвращеноНаДоработку</name>
  </enumValues>
  <enumValues>
    <name>Окончено</name>
  </enumValues>
  <enumValues>
    <name>ОконченоБезПроверки</name>
  </enumValues>
  <enumValues>
    <name>ОконченоАвтоматом</name>
  </enumValues>
  <enumValues>
    <name>НеОкончено</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/СтатусыПроцессаОбученияСУО/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции

// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Функция ЗначениеВЧисло(Значение) Экспорт
	
	Если Значение = Перечисления.СтатусыПроцессаОбученияСУО.Запланировано Тогда
		Возврат 1;
	КонецЕсли;
	
	Если Значение = Перечисления.СтатусыПроцессаОбученияСУО.Новое Тогда
		Возврат 2;
	КонецЕсли;
	
	Если Значение = Перечисления.СтатусыПроцессаОбученияСУО.Активно Тогда
		Возврат 3;
	КонецЕсли;
	
	Если Значение = Перечисления.СтатусыПроцессаОбученияСУО.Окончено Тогда
		Возврат 4;
	КонецЕсли;
	
	Если Значение = Перечисления.СтатусыПроцессаОбученияСУО.НеОкончено Тогда
		Возврат 5;
	КонецЕсли;
	
	Если Значение = Перечисления.СтатусыПроцессаОбученияСУО.Проверяется Тогда
		Возврат 6;
	КонецЕсли;	
	
	Если Значение = Перечисления.СтатусыПроцессаОбученияСУО.ВозвращеноНаДоработку Тогда
		Возврат 7;
	КонецЕсли;	
	
	Если Значение = Перечисления.СтатусыПроцессаОбученияСУО.НеДопущен Тогда
		Возврат 8;
	КонецЕсли;
	
	Если Значение = Перечисления.СтатусыПроцессаОбученияСУО.ОконченоБезПроверки Тогда
		Возврат 9;
	КонецЕсли;
	
	Если Значение = Перечисления.СтатусыПроцессаОбученияСУО.ОконченоАвтоматом Тогда
		Возврат 10;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

Функция ЧислоВЗначение(ЗначениеЧисло) Экспорт
	
	Если ЗначениеЧисло = 1 Тогда
		Возврат Перечисления.СтатусыПроцессаОбученияСУО.Запланировано;
	КонецЕсли;
	
	Если ЗначениеЧисло = 2 Тогда
		Возврат Перечисления.СтатусыПроцессаОбученияСУО.Новое;
	КонецЕсли;
	
	Если ЗначениеЧисло = 3 Тогда
		Возврат Перечисления.СтатусыПроцессаОбученияСУО.Активно;
	КонецЕсли;
	
	Если ЗначениеЧисло = 4 Тогда
		Возврат Перечисления.СтатусыПроцессаОбученияСУО.Окончено;
	КонецЕсли;
	
	Если ЗначениеЧисло = 5 Тогда
		Возврат Перечисления.СтатусыПроцессаОбученияСУО.НеОкончено;
	КонецЕсли;
	
	Если ЗначениеЧисло = 6 Тогда
		Возврат Перечисления.СтатусыПроцессаОбученияСУО.Проверяется;
	КонецЕсли;	
	
	Если ЗначениеЧисло = 7 Тогда
		Возврат Перечисления.СтатусыПроцессаОбученияСУО.ВозвращеноНаДоработку;
	КонецЕсли;		
	
	Если ЗначениеЧисло = 8 Тогда
		Возврат Перечисления.СтатусыПроцессаОбученияСУО.НеДопущен;
	КонецЕсли;
	
	Если ЗначениеЧисло = 9 Тогда
		Возврат Перечисления.СтатусыПроцессаОбученияСУО.ОконченоБезПроверки;
	КонецЕсли;
	
	Если ЗначениеЧисло = 10 Тогда
		Возврат Перечисления.СтатусыПроцессаОбученияСУО.ОконченоАвтоматом;
	КонецЕсли;
	
	Возврат Перечисления.СтатусыПроцессаОбученияСУО.ПустаяСсылка();	
	
КонецФункции

Функция ПредставлениеЗначения(Значение) Экспорт
	Возврат Строка(Значение);
КонецФункции

Функция ЧислоВПредставление(ЗначениеЧисло) Экспорт
	Возврат ПредставлениеЗначения(ЧислоВЗначение(ЗначениеЧисло));
КонецФункции

#КонецОбласти
	
#КонецЕсли
